package lab01;

/* Задание 1. Набрать приведенный пример, откомпилировать его и запустить. */
public class Task01 {
    public static void main(String[] args) {
        System.out.println("Have a nice day!");
    }
}